#include <stdio.h>

int main() {
	printf(
		"\n"
		"   ________  ____  __        ____                      __                __         \n"
		"  / ____/ / / / /_/ /_____  / __ \\____ _      ______  / /___  ____ _____/ /__  _____\n"
		" / /   / /_/ / __/ __/ __ \\/ / / / __ \\ | /| / / __ \\/ / __ \\/ __ \\/ __  / _ \\/ ___/\n"
		"/ /___/ __  / /_/ /_/ /_/ / /_/ / /_/ / |/ |/ / / / / / /_/ / /_/ / /_/ /  __/ /    \n"
		"\\____/_/ /_/\\__/\\__/ .___/_____/\\____/|__/|__/_/ /_/_/\\____/\\__,_/\\__,_/\\___/_/     \n"
		"                  /_/                                                               \n"
		"CHttpDownloader - 简易HTTP下载器\n"
	);
	while (1) {
		printf("\n");
		printf("请选择操作:\n");
		printf("1. 下载文件\n");
		printf("2. 设置\n");
		printf("3. 退出\n");
		printf("请输入选项 (1-3): ");

		int choice;
		scanf("%d", &choice);

		switch (choice) {
			case 1:
				break;
			case 2:
				break;
			case 3:
				printf("已退出程序。\n");
				return 0;
			default:
				printf("无效选项，请重新输入。\n");
		}
	}


}
